var com = {};
com.rongzer = {};
com.rongzer.message = {
		errorMessages:{
		"INFO":{
			"1001":"ID不能为空",
			"1002":"名字不能为空",
			"1003":"有子结点不能删除",
			"1004":"输入旧密码与原密码不一致",
			"1005":"新密码与确认密码不一致",
			"1006":"已存在相同的名字",
			"2001":"增加{0}成功",
			"2002":"增加{0}失败",
			"2003":"重复增加{0}操作",
			"2004":"编辑{0}成功",
			"2005":"编辑{0}失败",
			"2006":"删除{0}成功",
			"2007":"删除{0}失败",
			"2008":"启用{0}成功",
			"2009":"启用{0}失败",
			"2010":"停用{0}成功",
			"2011":"停用{0}失败",
			"2012":"发布{0}成功",
			"2013":"发布{0}失败",
			"2014":"取消发布{0}成功",
			"2015":"取消发布{0}失败",
			"2016":"批量发布{0}成功",
			"2017":"批量发布{0}失败",
			"2018":"批量删除{0}成功",
			"2019":"批量删除{0}失败",
			"2020":"{0}上架成功",
			"2021":"{0}上架失败",
			"2022":"{0}下架成功",
			"2023":"{0}下架失败",
			"2024":"重置密码成功",
			"2025":"重置密码失败",
			"2026":"修改密码成功",
			"2027":"修改密码失败"
		},
		"WARN":{	
		},
		"ERROR":{
		},
		dialogMessages:{
			"ONLY_DEL":"确定要删除吗?",
			"NOT_ONLY_DEL":"至少要选择一条数据",
			"ONLY_UPD":"确定要修改吗？"
		}
		
	}
};

/**
 * 根据code type 类型解析
 * @param code
 * @param type
 */
function parseErrorCode( code,type ,data){
	var result =  com.rongzer.message.errorMessages[ type ? "INFO" : type ][code];
	return result.replace(new RegExp("\\{0\\}","g"), data["moudleName"]);
}


